<script setup lang="ts">
import type { MapMatter } from '@/types/Map'

import NTEMap from '@/components/NTEMap.vue'

// MapArea
//
// [000] M10区
// [001] 桥间地
// [002] 未闻浦
// [003] 绘空町
// [004] 米格尔区
// [005] 新赫兰德区

const Matters: MapMatter[] = [
  {
    type: 'SceneArea001',
    name: '一级区域',
    icon: './icons/Default.webp',
    sites: [
      { name: 'M10区', x: 3875.521, y: 272754.47 },
      { name: '桥间地', x: -110297.08, y: 145296.62 },
      { name: '未闻浦', x: -169444.47, y: 201202.56 },
      { name: '绘空町', x: -133499.8, y: 112428.695 },
      { name: '米格尔区', x: -52933.387, y: 20294.473 },
      { name: '新赫兰德区', x: -4895.132, y: 97549.805 },
    ],
  },
  {
    type: 'SceneArea002',
    name: '二级区域',
    icon: './icons/Default.webp',
    sites: [
      { name: '绿墙坡', x: -105457.516, y: 125390.3 },
      { name: '半角街', x: -91038.086, y: 162591.45 },
      { name: '奥利哈刚「理想馆」', x: -193454.39, y: 219499.23 },
      { name: '塞润尼缇庄园', x: -166096.06, y: 182340.9 },
      { name: '水菱湖', x: -63600.45, y: 2461.524 },
      { name: '摇曳镇', x: -88497.22, y: -2394.52 },
      { name: '北角镇', x: -39815.51, y: -598.394 },
      { name: '库勒涅步行街', x: -9058.131, y: 85443.625 },
      { name: '愿木坡', x: 55341.59, y: 107145.805 },
      { name: '海角广场', x: 8263.953, y: 141041.72 },
    ],
  },
  {
    type: 'SceneArea002',
    name: '一级道路',
    icon: './icons/Default.webp',
    sites: [
      { name: '异象管理局', x: 3875.521, y: 272754.47 },
      { name: '提卡尔大桥', x: -66585.59, y: 244394.22 },
      { name: '鸢尾大桥', x: -69596.07, y: 130083.945 },
      { name: 'Z42环海公路', x: -82026.18, y: 174292.55 },
      { name: 'Z42环海公路', x: -149253.81, y: 158455.31 },
      { name: 'Z42环海公路', x: -184821.83, y: 235568.55 },
      { name: 'Z42环海公路', x: -185507.52, y: 178246.2 },
      { name: '火炬木大道', x: -121483.016, y: 162969.22 },
      { name: '水梨子大道', x: -118469.6, y: 177265.55 },
      { name: '水梨子大道', x: -142585.89, y: 142566.27 },
      { name: '卷叶榕大道', x: -138240.23, y: 111533.26 },
      { name: '林檎大道', x: -63520.465, y: 76078.836 },
      { name: '白尾树盘山公路', x: -89613.086, y: -37799.734 },
      { name: '白尾树盘山公路', x: 4478.396, y: -13048.215 },
      { name: '圣托里斯大道', x: -42779.316, y: 44476.477 },
      { name: '铁心9号路', x: -20263.98, y: 27370.613 },
      { name: '水菱湖路', x: -56256.223, y: 18332.826 },
      { name: '麦昆幽灵大道', x: -41875.83, y: 84357.85 },
      { name: '水晶山大道', x: -14689.976, y: 125337.23 },
      { name: '卡美洛大道', x: 1673.475, y: 116464.13 },
      { name: '鳄鱼钟大道', x: 15753.233, y: 110035.62 },
      { name: '弗拉明戈大道', x: 26594.482, y: 98738.625 },
      { name: '胡桃夹公路', x: -54783.484, y: 97376.3 },
      { name: '伊亚大道', x: -48329.35, y: 58561.258 },
      { name: '奇诺大道', x: 2246.343, y: 94480.12 },
      { name: '塔林大道', x: -27276.404, y: 136573.66 },
      { name: '鹦鹉螺隧道', x: -38470.098, y: 174193.38 },
    ],
  },
  {
    type: 'Heterotopia',
    name: '维特海默塔',
    icon: './icons/Heterotopia.webp',
    sites: [
      { name: '桥间地', x: -94823, y: 165376 },
      { name: '未闻浦', x: -184528.28, y: 211012.42 },
      { name: '绘空町', x: -171144.38, y: 106510.41 },
      { name: '米格尔区', x: -30515.836, y: 7779.323 },
      { name: '新赫兰德区', x: 10521.551, y: 65394.363 },
    ],
  },
  {
    type: 'Transfer',
    name: 'ReroReco电话亭',
    icon: './icons/Transfer.webp',
    sites: [
      { name: 'M10区-01', x: 4002.999, y: 260999.62 },
      { name: '桥间地-01', x: -91137.586, y: 153176.33 },
      { name: '桥间地-02', x: -123430, y: 153690 },
      { name: '绘空町-01', x: -135274.78, y: 200707.36 },
      { name: '绘空町-01', x: -152550, y: 128914 },
      { name: '绘空町-02', x: -102836.61, y: 66336.62 },
      { name: '米格尔区-01', x: -81535.125, y: -15737.951 },
      { name: '米格尔区-02', x: -18738.71, y: 39748.168 },
      { name: '米格尔区-03', x: 13070, y: 20005 },
      { name: '新赫兰德区-01', x: -58843.703, y: 84450.836 },
      { name: '新赫兰德区-02', x: 40423, y: 102071 },
      { name: '新赫兰德区-03', x: -9813.496, y: 124269.89 },
      { name: '新赫兰德区-04', x: 13545, y: 121325 },
      { name: '新赫兰德区-05', x: -11354.659, y: 74277.586 },
    ],
  },
]
</script>

<template>
  <NTEMap :matters="Matters" />
</template>
